Revit 2027 API
FieldValues(IList<ValueAtPoint>) Constructor
 Creates object from an array of domain point values
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldValues(
	IList<ValueAtPoint> valueAtPoint
)
Public Sub New (
	valueAtPoint As IList(Of ValueAtPoint)
)
public:
FieldValues(
	IList<ValueAtPoint^>^ valueAtPoint
)
new :
        valueAtPoint : IList<ValueAtPoint> -> FieldValues
Parameters
valueAtPoint IList<ValueAtPoint>
 Array of values, each corresponding to a domain point
Exceptions
Exception | Condition
ArgumentException |  valueAtPoint array contains members with different numbers of measurements
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldValues Class
FieldValues Overload
Autodesk.Revit.DB.Analysis Namespace